app/controllers/mannequins_controller.rb

  def index
    @mannequins = current_user.mannequins.all
---
SELECT "mannequins".* FROM "mannequins" WHERE "mannequins"."user_id" = $1  [["user_id", 1]]

  def create
    @mannequin = current_user.mannequins.new(mannequin_params)

    if @mannequin.save
---
INSERT INTO "mannequins" ("given_name", "surname", "measurements", "eye_color", "hair_color", "hair_length", "gender", "created_at", "updated_at", "height", "weight", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    if @mannequin.update(mannequin_params)
---
UPDATE "mannequins" SET "given_name" = $1, "surname" = $2, "measurements" = $3, "eye_color" = $4, "gender" = $5, "updated_at" = $6 WHERE "mannequins"."id" = $7  [["given_name", "jajaj"], ["surname", "j"], ["measurements", "jj"], ["eye_color", "j"], ["gender", "j"], ["updated_at", "2017-12-12 18:54:01.768010"], ["id", 25]]

  def destroy
    @mannequin.destroy
---
DELETE FROM "mannequins" WHERE "mannequins"."id" = $1  [["id", 1]]

    def set_mannequin
      @mannequin = current_user.mannequins.find(params[:id])
---
SELECT  "mannequins".* FROM "mannequins" WHERE "mannequins"."user_id" = $1 AND "mannequins"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 0], ["LIMIT", 1]]